#include "Cafe/OS/common/OSCommon.h"
#include "Cafe/OS/common/OSUtil.h"
#include "Cafe/HW/Espresso/PPCCallback.h"
#include "nlibcurl.h"

#include "openssl/bn.h"
#include "openssl/x509.h"
#include "openssl/ssl.h"

#define CURL_STRICTER

#include "curl/curl.h"
#include <unordered_map>
#include <atomic>

#include "Cafe/IOSU/legacy/iosu_crypto.h"
#include "Cafe/OS/libs/nsysnet/nsysnet.h"
#include "Cafe/OS/libs/coreinit/coreinit_MEM.h"

#include "util/helpers/ConcurrentQueue.h"
#include "Cafe/OS/common/PPCConcurrentQueue.h"
#include "Common/FileStream.h"
#include "config/ActiveSettings.h"

namespace nlibcurl
{
#define CURL_MULTI_HANDLE		(0x000bab1e)

#define NSSL_VERIFY_NONE		(0x0)
#define NSSL_VERIFY_PEER		(1<<0)
#define NSSL_VERIFY_HOSTNAME	(1<<1)
#define NSSL_VERIFY_DATE		(1<<2)

	enum QueueOrder
	{
		QueueOrder_None,

		QueueOrder_Result,
		QueueOrder_CBDone,

		QueueOrder_HeaderCB,
		QueueOrder_ReadCB,
		QueueOrder_WriteCB,
		QueueOrder_ProgressCB,

		QueueOrder_Perform,
		QueueOrder_Pause,
	};

	struct QueueMsg_t
	{
		QueueOrder order;
		union
		{
			uint32 result;

			struct
			{
				char* buffer;
				uint32 size;
				uint32 nitems;
			} header_cb;

			struct
			{
				char* buffer;
				uint32 size;
				uint32 nitems;
			} read_cb;

			struct
			{
				char* buffer;
				uint32 size;
				uint32 nmemb;
			} write_cb;

			struct
			{
				uint32 clientp;
				double dltotal;
				double dlnow;
				double ultotal;
				double ulnow;
			} progress_cb;

			struct
			{
				sint32 bitmask;
			} pause;

		};

	};

struct MEMPTRHash_t
{
	size_t operator()(const MEMPTR<void>& p) const
	{
		return p.GetMPTR();
	}
};

struct WU_curl_slist
{
	MEMPTR<char> data;
	MEMPTR<WU_curl_slist> next;
};

enum class WU_CURLcode
{
	placeholder = 0,
};

struct
{
	sint32 initialized;

	MEMPTR<void> proxyConfig;
	MEMPTR<curl_malloc_callback> malloc;
	MEMPTR<curl_free_callback> free;
	MEMPTR<curl_realloc_callback> realloc;
	MEMPTR<curl_strdup_callback> strdup;
	MEMPTR<curl_calloc_callback> calloc;
} g_nlibcurl = {};

using WU_CURL_off_t = uint64be;

enum class WU_HTTPREQ : uint32
{
	HTTPREQ_GET = 0x1,
	HTTPREQ_POST = 0x2,
	UKN_3 = 0x3,
};

struct WU_UserDefined
{
	// starting at 0xD8 (probably) in CURL_t
	/* 0x0D8 / +0x00 */ uint32be ukn0D8;
	/* 0x0DC / +0x04 */ uint32be ukn0DC;
	/* 0x0E0 / +0x08 */ MEMPTR<WU_curl_slist> headers;
	/* 0x0E4 / +0x0C */ uint32be ukn0E4;
	/* 0x0E8 / +0x10 */ uint32be ukn0E8;
	/* 0x0EC / +0x14 */ uint32be ukn0EC;
	/* 0x0F0 / +0x18 */ uint32be ukn0F0[4];
	/* 0x100 / +0x28 */ uint32be ukn100[4];
	/* 0x110 / +0x38 */ uint32be ukn110[4]; // +0x40 -> WU_CURL_off_t postfieldsize ?
	/* 0x120 / +0x48 */ uint32be ukn120[4];
	/* 0x130 / +0x58 */ uint32be ukn130[4];
	/* 0x140 / +0x68 */ uint32be ukn140[4];
	/* 0x150 / +0x78 */ uint32be ukn150[4];
	/* 0x160 / +0x88 */ uint32be ukn160[4];
	/* 0x170 / +0x98 */ uint32be ukn170[4];
	/* 0x180 / +0xA8 */ uint32be ukn180[4];
	/* 0x190 / +0xB0 */ sint64be infilesize_190{0};
	/* 0x198 / +0xB8 */ uint32be ukn198;
	/* 0x19C / +0xBC */ uint32be ukn19C;
	/* 0x1A0 / +0xC8 */ uint32be ukn1A0[4];
	/* 0x1B0 / +0xD8 */ uint32be ukn1B0[4];
	/* 0x1C0 / +0xE8 */ uint32be ukn1C0[4];
	/* 0x1D0 / +0xF8 */ uint32be ukn1D0[4];
	/* 0x1E0 / +0x108 */ uint32be ukn1E0;
	/* 0x1E4 / +0x108 */ uint32be ukn1E4;
	/* 0x1E8 / +0x108 */ uint32be ukn1E8;
	/* 0x1EC / +0x108 */ betype<WU_HTTPREQ> httpreq_1EC;
	/* 0x1F0 / +0x118 */ uint32be ukn1F0[4];

	void SetToDefault()
	{
		memset(this, 0, sizeof(WU_UserDefined));
		httpreq_1EC = WU_HTTPREQ::HTTPREQ_GET;
	}
};

struct CURL_t
{
	CURL* curl;

	uint32be hNSSL;
	uint32be nsslVerifyOptions;
	MEMPTR<void> out; // CURLOPT_WRITEDATA
	MEMPTR<void> in_set; // CURLOPT_READDATA
	MEMPTR<void> writeheader; // CURLOPT_HEADERDATA

	MEMPTR<void> fwrite_func; // CURLOPT_WRITEFUNCTION
	MEMPTR<void> fwrite_header; // CURLOPT_HEADERFUNCTION
	MEMPTR<void> fread_func_set; // CURLOPT_READFUNCTION

	MEMPTR<void> progress_client; // CURLOPT_PROGRESSDATA
	MEMPTR<void> fprogress; // CURLOPT_PROGRESSFUNCTION

	MEMPTR<void> fsockopt; // CURLOPT_SOCKOPTFUNCTION
	MEMPTR<void> sockopt_client; // CURLOPT_SOCKOPTDATA

	// Cemu specific
	OSThread_t* curlThread;
	MEMPTR<char> info_redirectUrl; // stores CURLINFO_REDIRECT_URL ptr
	MEMPTR<char> info_contentType; // stores CURLINFO_CONTENT_TYPE ptr
	bool isDirty{true};

	// debug
	struct  
	{
		uint32 activeRequestIndex{};
		uint32 responseRequestIndex{}; // set to activeRequestIndex once perform is called
		bool hasDumpedResultInfo{}; // set once the response info has been dumped (reset when next request is performed)
		FileStream* file_requestParam{};
		FileStream* file_responseHeaders{};
		FileStream* file_responseRaw{};
	}debug;

	// fields below match the actual memory layout, above still needs refactoring
	/* 0x78 */ uint32be ukn078;
	/* 0x7C */ uint32be ukn07C;
	/* 0x80 */ uint32be ukn080;
	/* 0x84 */ uint32be ukn084;
	/* 0x88 */ uint32be ukn088;
	/* 0x8C */ uint32be ukn08C;
	/* 0x90 */ uint32be ukn090[4];
	/* 0xA0 */ uint32be ukn0A0[4];
	/* 0xB0 */ uint32be ukn0B0[4];
	/* 0xC0 */ uint32be ukn0C0[4];
	/* 0xD0 */ uint32be ukn0D0;
	/* 0xD4 */ uint32be ukn0D4;
	/* 0xD8 */ WU_UserDefined set;
	/* 0x200 */ uint32be ukn200[4];
	/* 0x210 */ uint32be ukn210[4];
	/* 0x220 */ uint32be ukn220[4];
	/* 0x230 */ uint32be ukn230[4];
	/* 0x240 */ uint32be ukn240[4];
	/* 0x250 */ uint32be ukn250[4];
	/* 0x260 */ uint32be ukn260[4];
	/* 0x270 */ uint32be ukn270[4];
	/* 0x280 */ uint8be ukn280;
	/* 0x281 */ uint8be opt_no_body_281;
	/* 0x282 */ uint8be ukn282;
	/* 0x283 */ uint8be upload_283;
};
static_assert(sizeof(CURL_t) <= 0x8698);
static_assert(offsetof(CURL_t, ukn078) == 0x78);
static_assert(offsetof(CURL_t, set) == 0xD8);
static_assert(offsetof(CURL_t, set) + offsetof(WU_UserDefined, headers) == 0xE0);
static_assert(offsetof(CURL_t, set) + offsetof(WU_UserDefined, infilesize_190) == 0x190);
static_assert(offsetof(CURL_t, set) + offsetof(WU_UserDefined, httpreq_1EC) == 0x1EC);
static_assert(offsetof(CURL_t, opt_no_body_281) == 0x281);
typedef MEMPTR<CURL_t> CURLPtr;

#pragma pack(1) // may affect structs below, we can probably remove this but lets keep it for now as the code below is fragile

typedef struct
{
	//uint32be specifier; // 0x00
	//uint32be dirty; // 0x04
	MEMPTR<void> lockfunc; // 0x08
	MEMPTR<void> unlockfunc; // 0x0C
	MEMPTR<void> data; // 0x10
	//MEMPTR<void> uk14; // 0x14
	//MEMPTR<void> uk18; // 0x18

	CURLSH* curlsh;
	MEMPTR <CURL_t> curl;
	uint32 uk1;
}CURLSH_t; // SCURL
static_assert(sizeof(CURLSH_t) <= 0x1C);
typedef MEMPTR<CURLSH_t> CURLSHPtr;

typedef struct
{
	CURLM* curlm;
	std::vector<MEMPTR<CURL_t>> curl;
}CURLM_t;
static_assert(sizeof(CURLM_t) <= 0x80, "sizeof(CURLM_t)");
typedef MEMPTR<CURLM_t> CURLMPtr;

static_assert(sizeof(WU_curl_slist) <= 0x8, "sizeof(curl_slist_t)");

struct CURLMsg_t
{
	uint32be msg;
	MEMPTR<CURL_t> curl;
	uint32be result; // CURLcode
};

static_assert(sizeof(CURLMsg_t) <= 0xC, "sizeof(CURLMsg_t)");

#pragma pack()

#include "nlibcurlDebug.hpp"

size_t header_callback(char* buffer, size_t size, size_t nitems, void* userdata);

thread_local PPCConcurrentQueue<QueueMsg_t>* g_callerQueue;
thread_local ConcurrentQueue<QueueMsg_t>* g_threadQueue;
